# неизменяемый список

# t = tuple('hello')
# t = ('hello', (1, 2, 3)) #кортеж в кортеже
# t = 'hello', (1, 2, 3)   # тоже самое

# t = '1', '2', '3', '4'

# x = ['s', 3, 'ff']         # кортеж из списка
# t = tuple(x)

# t = (((((('sds',))))))
# t = (('d',),((((('sds',))))))

# a = ('a', 'b')
# b = ('c', 'd')
# t = a, b


# Список в кортеже изменяемый (mutable)!
# a = ['a', 'b']
# t = a, 'dfs'
# t[0][0] = 'f'
# print(tuple(t[0]))


# Конкатенация
# x = 0, -1, -2, -3, 4, 5
# y = 6, 7, 8
#
# t = x + y

# print(t[2:4])

# Повторение
# print(t * 3)
# print(type(t))

# for i in t:
#     print(i)


# количество положительных чисел
# i = 0
# k = 0
# while i < len(t):
#     if t[i] > 0:
#         k = k + 1
#     i = i + 1
#
# print(k)

# Сформировать новый список из элементов кортежа
t = (1, 2, 3, 4, 4, 4, 5, 6)
# x = [i for i in t]
# print(x)

# Проверка вхождения элемента в кортеж
# if 3 in t:
#     print('ok')

# индекс элемента
# print(t.index(3))

# количество вхождений элемента
print(t.count(4))



